# Common Taps
tap "anomalyco/tap"
tap "oven-sh/bun"

# macOS-only Taps
on_macos do
  tap "nikitabobko/tap"
  tap "koekeishiya/formulae"
  tap "caskroom/cask"
end

# CLI Tools (Cross-platform)
brew "bash"
brew "bat"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "fish"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "git"
brew "go"
brew "openjdk"
brew "gradle"
brew "imagemagick"
brew "python@3.14"
brew "jdtls"
brew "jp2a"
brew "lazygit"
brew "libedit"
brew "libnet"
brew "libpcap"
brew "lua"
brew "luarocks"
brew "mailsy"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nginx", restart_service: :changed
brew "nmap"
brew "numpy"
brew "ollama"
brew "pipx"
brew "pkgconf"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"

# macOS-only Formulae
on_macos do
  brew "iproute2mac"
  brew "macmon"
  brew "osx-cpu-temp"
end

# Linux-only Formulae (example)
on_linux do
  # Add Linux specific brews here if needed
end

# macOS-only Casks
on_macos do
  cask "nikitabobko/tap/aerospace"
  cask "gemini"
  cask "ghostty"
  cask "karabiner-elements"
  cask "kitty"
  cask "obsidian"
  cask "temurin"
  cask "warp"
  cask "caskroom/cask/xquartz"
  cask "zen"
end

# VS Code Extensions (Cross-platform)
vscode "adpyke.codesnap"
vscode "andenetalexander.vim-cheatsheet"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "hediet.debug-visualizer"
vscode "knozz.subwayame"
vscode "ms-azuretools.vscode-containers"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mvllow.rose-pine"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "tobias-z.vscode-harpoon"
vscode "tonybaloney.vscode-pets"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
