
# CLI Tools (Cross-platform)
brew "bat"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "fish"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "git"
brew "go"
brew "openjdk"
brew "python@3.14"
brew "jdtls"
brew "jp2a"
brew "lazygit"
brew "libedit"
brew "libnet"
brew "libpcap"
brew "lua"
brew "luarocks"
brew "mailsy"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nginx", restart_service: :changed
brew "nmap"
brew "numpy"
brew "pipx"
brew "pkgconf"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "yazi"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"

